package main

import (
	"encoding/hex"
	"testing"

	"github.com/stretchr/testify/assert"
)

func TestScrapeJunniRaw(t *testing.T) {
	url := "https://web.archive.org/web/20240201014844if_/https://www.shogi.or.jp/match/junni/2023/82a/index.html"

	result, err := scrapeJunniRaw(url)
	if assert.NoError(t, err) {
		assert.Equal(t, url, result.URL)
		assert.Equal(t, "第82期名人戦・順位戦　Ａ級", result.Name)
		assert.Equal(t, "sha256", result.HashAlgorithm)
		expectedHash, _ := hex.DecodeString("88e20b33b09dfbd3656411ad803fa47a094601918112403b324bb51eb29637c5")
		assert.Equal(t, expectedHash, result.Hash)
		expectedTable := [][][]string{
			{{""}, {"1"}, {"<a href=\"/player/pro/235.html\">渡辺\u3000明</a>九段"}, {"4"}, {"4"}, {"●", "佐々木勇"}, {"○", "稲葉"}, {"●", "豊島"}, {"○", "佐藤天"}, {"○", "斎藤慎"}, {"●", "永瀬"}, {"○", "菅井"}, {"●", "中村太"}, {"先", "広瀬"}},
			{{""}, {"2"}, {"<a href=\"/player/pro/255.html\">広瀬章人</a>九段"}, {"3"}, {"5"}, {"○", "\n    中村太"}, {"●", "斎藤慎"}, {"●", "佐々木勇"}, {"●", "菅井"}, {"●", "永瀬"}, {"●", "佐藤天"}, {"○", "豊島"}, {"○", "稲葉"}, {"", "渡辺明"}},
			{{""}, {"3"}, {"<a href=\"/player/pro/264.html\">豊島将之</a>九段"}, {"6"}, {"2"}, {"○", "稲葉"}, {"○", "佐々木勇"}, {"○", "渡辺明"}, {"○", "永瀬"}, {"○", "佐藤天"}, {"○", "中村太"}, {"●", "広瀬"}, {"●", "斎藤慎"}, {"", "菅井"}},
			{{""}, {"4"}, {"<a href=\"/player/pro/276.html\">永瀬拓矢</a>九段"}, {"5"}, {"3"}, {"●", "菅井"}, {"○", "佐藤天"}, {"○", "斎藤慎"}, {"●", "豊島"}, {"○", "広瀬"}, {"○", "渡辺明"}, {"●", "稲葉"}, {"○", "佐々木勇"}, {"先", "中村太"}},
			{{""}, {"5"}, {"<a href=\"/player/pro/286.html\">斎藤慎太郎</a>八段"}, {"3"}, {"5"}, {"●", "佐藤天"}, {"○", "広瀬"}, {"●", "永瀬"}, {"○", "稲葉"}, {"●", "渡辺明"}, {"●", "菅井"}, {"●", "中村太"}, {"○", "豊島"}, {"先", "佐々木勇"}},
			{{""}, {"6"}, {"<a href=\"/player/pro/278.html\">菅井竜也</a>八段"}, {"5"}, {"3"}, {"○", "永瀬"}, {"○", "中村太"}, {"●", "稲葉"}, {"○", "広瀬"}, {"○", "佐々木勇"}, {"○", "斎藤慎"}, {"●", "渡辺明"}, {"●", "佐藤天"}, {"先", "豊島"}},
			{{""}, {"7"}, {"<a href=\"/player/pro/269.html\">稲葉\u3000陽</a>八段"}, {"3"}, {"5"}, {"●", "豊島"}, {"●", "渡辺明"}, {"○", "菅井"}, {"●", "斎藤慎"}, {"○", "中村太"}, {"●", "佐々木勇"}, {"○", "永瀬"}, {"●", "広瀬"}, {"先", "佐藤天"}},
			{{""}, {"8"}, {"<a href=\"/player/pro/263.html\">佐藤天彦</a>九段"}, {"4"}, {"4"}, {"○", "斎藤慎"}, {"●", "永瀬"}, {"●", "中村太"}, {"●", "渡辺明"}, {"●", "豊島"}, {"○", "広瀬"}, {"○", "佐々木勇"}, {"○", "菅井"}, {"", "稲葉"}},
			{{""}, {"9"}, {"<a href=\"/player/pro/280.html\">佐々木勇気</a>八段"}, {"3"}, {"5"}, {"○", "渡辺明"}, {"●", "豊島"}, {"○", "広瀬"}, {"●", "中村太"}, {"●", "菅井"}, {"○", "稲葉"}, {"●", "佐藤天"}, {"●", "永瀬"}, {"", "斎藤慎"}},
			{{""}, {"10"}, {"<a href=\"/player/pro/261.html\">中村太地</a>八段"}, {"4"}, {"4"}, {"●", "広瀬"}, {"●", "菅井"}, {"○", "佐藤天"}, {"○", "佐々木勇"}, {"●", "稲葉"}, {"●", "豊島"}, {"○", "斎藤慎"}, {"○", "渡辺明"}, {"", "永瀬"}},
		}
		assert.Equal(t, expectedTable, result.Table)
	}
}
